Revit 2027 API
AnalysisDisplayColoredSurfaceSettings.ShowContourLines Property
 If true, show contour lines in the analysis display.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowContourLines { get; set; }
Public Property ShowContourLines As Boolean
	Get
	Set
public:
property bool ShowContourLines {
	bool get ();
	void set (bool value);
}
member ShowContourLines : bool with get, set
Property Value
Boolean
See Also
Reference
AnalysisDisplayColoredSurfaceSettings Class
Autodesk.Revit.DB.Analysis Namespace